# Homebrew Bundle
# https://github.com/Homebrew/homebrew-bundle

# Taps
tap 'homebrew/cask-fonts'

# CLI Tools
brew 'bat'
brew 'composer'
brew 'coreutils'	    # Those that come with macOS are outdated
brew 'ctags'
brew 'eza'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'grep'
brew 'jq'
brew 'ovyerus/klog/klog'
brew 'lazygit'
brew 'mas'
brew 'neovim', args: ['HEAD']
brew 'ripgrep'
brew 'tldr'
brew 'tmux'
brew 'timewarrior'
brew 'tree'
brew 'zoxide'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'

# Apps
cask '1password'
cask '1password-cli'
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox@developer-edition'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'kitty'
cask 'logi-options-plus' 
cask 'microsoft-teams'
cask 'obsidian'
cask 'openvpn-connect'
cask 'proton-drive'
cask 'proton-mail'
cask 'protonvpn'
cask 'spotify'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-iosevka'
cask 'font-jetbrains-mono'
cask 'font-symbols-only-nerd-font'
cask 'font-victor-mono'

# Mac App Store
mas 'Magnet', id: 441258766
#mas 'Xcode', id: 497799835
