# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# Packages
brew 'coreutils'	    # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'lastpass-cli'
brew 'mackup'
brew 'mas'
brew 'neovim'
brew 'pkg-config'
brew 'ripgrep'
brew 'zsh'

# Development
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'

# Apps
cask 'alfred'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'jetbrains-toolbox'
cask 'karabiner-elements'
cask 'microsoft-outlook'
cask 'microsoft-teams'
cask 'phpstorm'
cask 'private-internet-access'
cask 'spotify'
cask 'tunnelblick'
cask 'tuple'
cask 'toggl'
cask 'vlc'
cask 'whatsapp'

# Fonts
cask 'font-jetbrains-mono'

# Mac App Store
mas 'Amphetamine', id: 937984704
mas 'Magnet', id: 441258766
mas 'Xcode', id: 497799835
